Repository: Isaac-Lee/python-docs-ko
Catalog: library/*.po
Languages: ast

source: :mod:`ast` --- Abstract Syntax Trees
ast: :mod:`ast` --- 추상 구문 트리

source: **Source code:** :source:`Lib/ast.py`
ast: **소스 코드:** :source:`Lib/ast.py`

source: The :mod:`ast` module helps Python applications to process trees of the Python abstract syntax grammar. The abstract syntax itself might change with each Python release; this module helps to find out programmatically what the current grammar looks like.
ast: :mod:`ast` 모듈은 파이썬 응용 프로그램이 파이썬 추상 구문 문법의 트리를 처리하는 데 도움을 줍니다. 추상 구문 자체는 각 파이썬 릴리스마다 바뀔 수 있습니다; 이 모듈은 프로그래밍 방식으로 현재 문법의 모양을 찾는 데 도움이 됩니다.

source: An abstract syntax tree can be generated by passing :data:`ast.PyCF_ONLY_AST` as a flag to the :func:`compile` built-in function, or using the :func:`parse` helper provided in this module. The result will be a tree of objects whose classes all inherit from :class:`ast.AST`. An abstract syntax tree can be compiled into a Python code object using the built-in :func:`compile` function.
ast: :data:`ast.PyCF_ONLY_AST`\를 플래그로 :func:`compile` 내장 함수에 전달하거나, 이 모듈에서 제공된 :func:`parse` 도우미를 사용하여 추상 구문 트리를 생성할 수 있습니다. 결과는 클래스가 모두 :class:`ast.AST`\에서 상속되는 객체들의 트리가 됩니다. 내장 :func:`compile` 함수를 사용하여 추상 구문 트리를 파이썬 코드 객체로 컴파일할 수 있습니다.

source: Abstract Grammar
ast: 추상 문법

source: The abstract grammar is currently defined as follows:
ast: 추상 문법은 현재 다음과 같이 정의됩니다:

source: Node classes
ast: 노드 클래스

source: This is the base of all AST node classes. The actual node classes are derived from the :file:`Parser/Python.asdl` file, which is reproduced :ref:`below <abstract-grammar>`. They are defined in the :mod:`_ast` C module and re-exported in :mod:`ast`.
ast: 이것은 모든 AST 노드 클래스의 베이스입니다. 실제 노드 클래스는 :file:`Parser/Python.asdl` 파일에서 파생되며, 이 파일의 내용은 :ref:`아래 <abstract-grammar>`\에서 볼 수 있습니다. :mod:`_ast` C 모듈에 정의되어 있으며 :mod:`ast`\로 다시 내보내 집니다.

source: There is one class defined for each left-hand side symbol in the abstract grammar (for example, :class:`ast.stmt` or :class:`ast.expr`). In addition, there is one class defined for each constructor on the right-hand side; these classes inherit from the classes for the left-hand side trees. For example, :class:`ast.BinOp` inherits from :class:`ast.expr`. For production rules with alternatives (aka "sums"), the left-hand side class is abstract: only instances of specific constructor nodes are ever created.
ast: 추상 문법의 각 좌변 심볼마다 하나의 클래스가 정의되어 있습니다 (예를 들어, :class:`ast.stmt`\나 :class:`ast.expr`). 또한, 우변의 생성자마다 하나의 클래스가 정의되어 있습니다; 이 클래스는 좌변 트리의 클래스에서 상속됩니다. 예를 들어, :class:`ast.BinOp`\는 :class:`ast.expr`\에서 상속됩니다. 대안을 갖는 생성 규칙(일명 "합")의 경우, 좌변 클래스는 추상입니다: 특정 생성자 노드의 인스턴스만 만들어집니다.

source: Each concrete class has an attribute :attr:`_fields` which gives the names of all child nodes.
ast: 각 구상 클래스에는 모든 자식 노드의 이름을 제공하는 어트리뷰트 :attr:`_fields`\가 있습니다.

source: Each instance of a concrete class has one attribute for each child node, of the type as defined in the grammar. For example, :class:`ast.BinOp` instances have an attribute :attr:`left` of type :class:`ast.expr`.
ast: 구상 클래스의 각 인스턴스에는 각 자식 노드마다 문법에 정의된 형의 어트리뷰트가 하나씩 있습니다. 예를 들어, :class:`ast.BinOp` 인스턴스는 :class:`ast.expr` 형의 어트리뷰트 :attr:`left`\를 갖습니다.

source: If these attributes are marked as optional in the grammar (using a question mark), the value might be ``None``. If the attributes can have zero-or-more values (marked with an asterisk), the values are represented as Python lists. All possible attributes must be present and have valid values when compiling an AST with :func:`compile`.
ast: 문법에서 이러한 어트리뷰트가 선택적으로 표시되면 (물음표를 사용해서), 값은 ``None``\일 수 있습니다. 어트리뷰트가 0개 이상의 값을 가질 수 있으면 (애스터리스크로 표시됩니다), 값은 파이썬 리스트로 표현됩니다. :func:`compile`\로 AST를 컴파일할 때 가능한 모든 어트리뷰트가 존재하고 유효한 값을 가져야 합니다.

source: Instances of :class:`ast.expr` and :class:`ast.stmt` subclasses have :attr:`lineno`, :attr:`col_offset`, :attr:`lineno`, and :attr:`col_offset` attributes. The :attr:`lineno` and :attr:`end_lineno` are the first and last line numbers of source text span (1-indexed so the first line is line 1) and the :attr:`col_offset` and :attr:`end_col_offset` are the corresponding UTF-8 byte offsets of the first and last tokens that generated the node. The UTF-8 offset is recorded because the parser uses UTF-8 internally.
ast: :class:`ast.expr`\과 :class:`ast.stmt` 서브 클래스의 인스턴스에는 :attr:`lineno`, :attr:`col_offset`, :attr:`lineno` 및 :attr:`col_offset` 어트리뷰트가 있습니다. :attr:`lineno`\와 :attr:`end_lineno`\는 소스 텍스트 스팬의 첫 번째와 마지막 줄 번호(1-인덱싱이라서 첫 번째 줄은 줄 1입니다)이고 :attr:`col_offset`\과 :attr:`end_col_offset`\은 노드를 생성한 첫 번째와 마지막 토큰의 해당 UTF-8 바이트 오프셋입니다. 구문 분석기가 UTF-8을 내부적으로 사용하기 때문에 UTF-8 오프셋이 기록됩니다.

source: Note that the end positions are not required by the compiler and are therefore optional. The end offset is *after* the last symbol, for example one can get the source segment of a one-line expression node using ``source_line[node.col_offset : node.end_col_offset]``.
ast: 종료 위치는 컴파일러에 필요하지 않아서 선택 사항입니다. 종료 오프셋은 마지막 심볼 *뒤*\입니다. 예를 들어 ``source_line[node.col_offset : node.end_col_offset]``\를 사용하여 한 줄 표현식 노드의 소스 세그먼트를 가져올 수 있습니다.

source: The constructor of a class :class:`ast.T` parses its arguments as follows:
ast: :class:`ast.T` 클래스의 생성자는 다음과 같이 인자를 구문 분석합니다:

source: If there are positional arguments, there must be as many as there are items in :attr:`T._fields`; they will be assigned as attributes of these names.
ast: 위치 인자가 있으면, :attr:`T._fields`\에 있는 항목 수만큼 있어야 합니다; 이러한 이름의 어트리뷰트로 대입될 것입니다.

source: If there are keyword arguments, they will set the attributes of the same names to the given values.
ast: 키워드 인자가 있으면, 같은 이름의 어트리뷰트를 지정된 값으로 설정합니다.

source: For example, to create and populate an :class:`ast.UnaryOp` node, you could use ::
ast: 예를 들어, :class:`ast.UnaryOp` 노드를 만들고 채우려면, 다음과 같이 할 수 있습니다 ::

source: or the more compact ::
ast: 또는 더 간결하게 ::

source: Class :class:`ast.Constant` is now used for all constants.
ast: :class:`ast.Constant` 클래스는 이제 모든 상수에 사용됩니다.

source: Simple indices are represented by their value, extended slices are represented as tuples.
ast: 단순 인덱스는 값으로 표현되고, 확장 슬라이스는 튜플로 표현됩니다.

source: Old classes :class:`ast.Num`, :class:`ast.Str`, :class:`ast.Bytes`, :class:`ast.NameConstant` and :class:`ast.Ellipsis` are still available, but they will be removed in future Python releases. In the meantime, instantiating them will return an instance of a different class.
ast: 이전 클래스 :class:`ast.Num`, :class:`ast.Str`, :class:`ast.Bytes`, :class:`ast.NameConstant` 및 :class:`ast.Ellipsis`\는 여전히 사용할 수 있지만, 향후 파이썬 릴리스에서 제거될 예정입니다. 그동안, 이들을 인스턴스 화하면 다른 클래스의 인스턴스가 반환됩니다.

source: Old classes :class:`ast.Index` and :class:`ast.ExtSlice` are still available, but they will be removed in future Python releases. In the meantime, instantiating them will return an instance of a different class.
ast: 이전 클래스 :class:`ast.Index`\와 :class:`ast.ExtSlice`\는 여전히 사용할 수 있지만, 향후 파이썬 릴리스에서 제거될 예정입니다. 그동안, 이들을 인스턴스 화하면 다른 클래스의 인스턴스가 반환됩니다.

source: Literals
ast: 리터럴

source: A constant value. The ``value`` attribute of the ``Constant`` literal contains the Python object it represents. The values represented can be simple types such as a number, string or ``None``, but also immutable container types (tuples and frozensets) if all of their elements are constant.
ast: 상숫값. ``Constant`` 리터럴의 ``value`` 어트리뷰트는 그것이 나타내는 파이썬 객체를 포함합니다. 표현되는 값은 숫자, 문자열 또는 ``None``\과 같은 간단한 형일 수 있지만, 모든 요소가 상수라면 불변 컨테이너 형(튜플과 frozenset)일 수도 있습니다.

source: Node representing a single formatting field in an f-string. If the string contains a single formatting field and nothing else the node can be isolated otherwise it appears in :class:`JoinedStr`.
ast: f-문자열에서 단일 포매팅 필드를 나타내는 노드. 문자열에 단일 포매팅 필드가 포함되어 있고 다른 것이 없으면 노드를 분리 할 수 있습니다, 그렇지 않으면 :class:`JoinedStr`\에 나타납니다.

source: ``value`` is any expression node (such as a literal, a variable, or a function call).
ast: ``value``\는 모든 표현식 노드(가령 리터럴, 변수 또는 함수 호출)입니다.

source: ``conversion`` is an integer:
ast: ``conversion``\은 정수입니다:

source: -1: no formatting
ast: -1: 포매팅 없음

source: 115: ``!s`` string formatting
ast: 115: ``!s`` 문자열 포매팅

source: 114: ``!r`` repr formatting
ast: 114: ``!r`` repr 포매팅

source: 97: ``!a`` ascii formatting
ast: 97: ``!a`` ascii 포매팅

source: ``format_spec`` is a :class:`JoinedStr` node representing the formatting of the value, or ``None`` if no format was specified. Both ``conversion`` and ``format_spec`` can be set at the same time.
ast: ``format_spec``\은 값의 포매팅을 나타내는 :class:`JoinedStr` 노드이거나, 표맷이 지정되지 않았으면 ``None``\입니다. ``conversion``\과 ``format_spec``\을 동시에 설정할 수 있습니다.

source: An f-string, comprising a series of :class:`FormattedValue` and :class:`Constant` nodes.
ast: 일련의 :class:`FormattedValue`\와 :class:`Constant` 노드로 구성된 f-문자열.

source: A list or tuple. ``elts`` holds a list of nodes representing the elements. ``ctx`` is :class:`Store` if the container is an assignment target (i.e. ``(x,y)=something``), and :class:`Load` otherwise.
ast: 리스트나 튜플. ``elts``\는 요소를 나타내는 노드의 리스트를 보유합니다. ``ctx``\는 컨테이너가 대입 대상이면 (가령 ``(x,y)=something``) :class:`Store`\이고, 그렇지 않으면 :class:`Load`\입니다.

source: A set. ``elts`` holds a list of nodes representing the set's elements.
ast: 집합. ``elts``\는 집합의 요소를 나타내는 노드의 리스트를 보유합니다.

source: A dictionary. ``keys`` and ``values`` hold lists of nodes representing the keys and the values respectively, in matching order (what would be returned when calling :code:`dictionary.keys()` and :code:`dictionary.values()`).
ast: 딕셔너리. ``keys``\와 ``values``\는 각각 키와 값을 나타내는 노드의 리스트를 일치하는 순서대로 (:code:`dictionary.keys()`\와 :code:`dictionary.values()`\를 호출할 때 반환되는 순서) 보유합니다.

source: When doing dictionary unpacking using dictionary literals the expression to be expanded goes in the ``values`` list, with a ``None`` at the corresponding position in ``keys``.
ast: 딕셔너리 리터럴을 사용하여 딕셔너리 언 패킹을 수행할 때 확장될 표현식은 ``values`` 리스트로 가고, ``keys``\의 해당 위치에는 ``None``\이 갑니다.

source: Variables
ast: 변수

source: A variable name. ``id`` holds the name as a string, and ``ctx`` is one of the following types.
ast: 변수 이름. ``id``\는 이름을 문자열로 보유하며, ``ctx``\는 다음 형 중 하나입니다.

source: Variable references can be used to load the value of a variable, to assign a new value to it, or to delete it. Variable references are given a context to distinguish these cases.
ast: 변수 참조는 변숫값을 로드하거나, 그것에 새 값을 대입하거나, 그것을 삭제하는데 사용될 수 있습니다. 변수 참조에는 이러한 경우를 구별하기 위한 컨텍스트가 제공됩니다.

source: A ``*var`` variable reference. ``value`` holds the variable, typically a :class:`Name` node. This type must be used when building a :class:`Call` node with ``*args``.
ast: ``*var`` 변수 참조. ``value``\는 변수(일반적으로 :class:`Name` 노드)를 보유합니다. 이 형은 ``*args``\로 :class:`Call` 노드를 빌드할 때 사용해야 합니다.

source: Expressions
ast: 표현식

source: When an expression, such as a function call, appears as a statement by itself with its return value not used or stored, it is wrapped in this container. ``value`` holds one of the other nodes in this section, a :class:`Constant`, a :class:`Name`, a :class:`Lambda`, a :class:`Yield` or :class:`YieldFrom` node.
ast: 표현식(가령 함수 호출)이 반환 값이 사용되거나 저장되지 않은 자신만의 문장으로 나타나면, 이 컨테이너에 래핑 됩니다. ``value``\는 이 섹션의 다른 노드인 :class:`Constant`, :class:`Name`, :class:`Lambda`, :class:`Yield` 또는 :class:`YieldFrom` 노드 중 하나를 보유합니다.

source: A unary operation. ``op`` is the operator, and ``operand`` any expression node.
ast: 단항 연산. ``op``\는 연산자이고, ``operand``\는 임의의 표현식 노드입니다.

source: Unary operator tokens. :class:`Not` is the ``not`` keyword, :class:`Invert` is the ``~`` operator.
ast: 단항 연산자 토큰. :class:`Not`\은 ``not`` 키워드이고, :class:`Invert`\는 ``~`` 연산자입니다.

source: A binary operation (like addition or division). ``op`` is the operator, and ``left`` and ``right`` are any expression nodes.
ast: 이항 연산 (더하기나 나누기 같은). ``op``\는 연산자이고, ``left``\와 ``right``\는 임의의 표현식 노드입니다.

source: Binary operator tokens.
ast: 이항 연산자 토큰.

source: A boolean operation, 'or' or 'and'. ``op`` is :class:`Or` or :class:`And`. ``values`` are the values involved. Consecutive operations with the same operator, such as ``a or b or c``, are collapsed into one node with several values.
ast: 불리언 연산, 'or' 나 'and'. ``op``\는 :class:`Or`\나 :class:`And`\입니다. ``values``\는 관련된 값입니다. 같은 연산자를 사용하는 연속 연산(가령 ``a or b or c``)은 여러 값을 가진 하나의 노드로 축소됩니다.

source: This doesn't include ``not``, which is a :class:`UnaryOp`.
ast: 여기에는 :class:`UnaryOp`\인 ``not``\이 포함되지 않습니다.

source: Boolean operator tokens.
ast: 불리언 연산자 토큰.

source: A comparison of two or more values. ``left`` is the first value in the comparison, ``ops`` the list of operators, and ``comparators`` the list of values after the first element in the comparison.
ast: 둘 이상의 값의 비교. ``left``\는 비교의 첫 번째 값이고, ``ops``\는 연산자의 리스트이며, ``comparators``\는 비교의 첫 번째 요소 다음의 값 리스트입니다.

source: Comparison operator tokens.
ast: 비교 연산자 토큰.

source: A function call. ``func`` is the function, which will often be a :class:`Name` or :class:`Attribute` object. Of the arguments:
ast: 함수 호출. ``func``\는 함수이며, 종종 :class:`Name`\이나 :class:`Attribute` 객체입니다. 인자 중:

source: ``args`` holds a list of the arguments passed by position.
ast: ``args``\는 위치로 전달된 인자의 리스트를 보유합니다.

source: ``keywords`` holds a list of :class:`keyword` objects representing arguments passed by keyword.
ast: ``keywords``\는 키워드로 전달된 인자를 나타내는 :class:`keyword` 객체의 리스트를 보유합니다.

source: When creating a ``Call`` node, ``args`` and ``keywords`` are required, but they can be empty lists. ``starargs`` and ``kwargs`` are optional.
ast: ``Call`` 노드를 만들 때, ``args``\와 ``keywords``\는 필수이지만, 비어있는 리스트일 수 있습니다. ``starargs``\와 ``kwargs``\는 선택적입니다.

source: A keyword argument to a function call or class definition. ``arg`` is a raw string of the parameter name, ``value`` is a node to pass in.
ast: 함수 호출이나 클래스 정의에 대한 키워드 인자. ``arg``\는 매개 변수 이름의 원시 문자열이고, ``value``\는 전달할 노드입니다.

source: An expression such as ``a if b else c``. Each field holds a single node, so in the following example, all three are :class:`Name` nodes.
ast: ``a if b else c``\와 같은 표현식. 각 필드는 단일 노드를 보유해서, 다음 예에서, 세 개 모두 :class:`Name` 노드입니다.

source: Attribute access, e.g. ``d.keys``. ``value`` is a node, typically a :class:`Name`. ``attr`` is a bare string giving the name of the attribute, and ``ctx`` is :class:`Load`, :class:`Store` or :class:`Del` according to how the attribute is acted on.
ast: 어트리뷰트 액세스, 예를 들어 ``d.keys``. ``value``\는 노드(보통 :class:`Name`)입니다. ``attr``\은 어트리뷰트의 이름을 제공하는 문자열이며, ``ctx``\는 어트리뷰트에 적용되는 방식에 따라 :class:`Load`, :class:`Store` 또는 :class:`Del`\입니다.

source: A named expression. This AST node is produced by the assignment expressions operator (also known as the walrus operator). As opposed to the :class:`Assign` node in which the first argument can be multiple nodes, in this case both ``target`` and ``value`` must be single nodes.
ast: 명명된 표현식. 이 AST 노드는 대입 표현식 연산자(바다코끼리(walrus) 연산자라고도 합니다)에 의해 생성됩니다. 첫 번째 인자가 여러 노드일 수 있는 :class:`Assign` 노드와 달리, 이 경우에는 ``target``\과 ``value``\는 모두 단일 노드여야 합니다.

source: Subscripting
ast: 서브스크립팅

source: A subscript, such as ``l[1]``. ``value`` is the subscripted object (usually sequence or mapping). ``slice`` is an index, slice or key. It can be a :class:`Tuple` and contain a :class:`Slice`. ``ctx`` is :class:`Load`, :class:`Store` or :class:`Del` according to the action performed with the subscript.
ast: 서브스크립트, 가령 ``l[1]``. ``value``\는 서브스크립트되는 객체입니다 (보통 시퀀스나 매핑). ``slice``\는 인덱스, 슬라이스 또는 키입니다. :class:`Tuple`\일 수 있으며 :class:`Slice`\를 포함합니다. ``ctx``\는 서브스크립트로 수행되는 동작에 따라 :class:`Load`, :class:`Store` 또는 :class:`Del`\입니다.

source: Regular slicing (on the form ``lower:upper`` or ``lower:upper:step``). Can occur only inside the *slice* field of :class:`Subscript`, either directly or as an element of :class:`Tuple`.
ast: 일반 슬라이싱 (``lower:upper``\나 ``lower:upper:step`` 형식). :class:`Subscript`\의 *slice* 필드 내에서만 직접 또는 :class:`Tuple`\의 요소로 등장할 수 있습니다.

source: Comprehensions
ast: 컴프리헨션

source: List and set comprehensions, generator expressions, and dictionary comprehensions. ``elt`` (or ``key`` and ``value``) is a single node representing the part that will be evaluated for each item.
ast: 리스트와 집합 컴프리헨션, 제너레이터 표현식 및 딕셔너리 컴프리헨션. ``elt``\(또는 ``key``\와 ``value``)는 항목마다 평가될 부분을 나타내는 단일 노드입니다.

source: ``generators`` is a list of :class:`comprehension` nodes.
ast: ``generators``\는 :class:`comprehension` 노드의 리스트입니다.

source: One ``for`` clause in a comprehension. ``target`` is the reference to use for each element - typically a :class:`Name` or :class:`Tuple` node. ``iter`` is the object to iterate over. ``ifs`` is a list of test expressions: each ``for`` clause can have multiple ``ifs``.
ast: 컴프리헨션에서 하나의 ``for`` 절. ``target``\은 각 요소(보통 :class:`Name`\이나 :class:`Tuple` 노드)에 사용할 참조입니다. ``iter``\는 이터레이트 할 객체입니다. ``ifs``\는 테스트 표현식의 리스트입니다: 각 ``for`` 절은 여러 ``ifs``\를 가질 수 있습니다.

source: ``is_async`` indicates a comprehension is asynchronous (using an ``async for`` instead of ``for``). The value is an integer (0 or 1).
ast: ``is_async``\는 컴프리헨션이 비동기임을 나타냅니다 (``for`` 대신 ``async for``\를 사용합니다). 값은 정수(0이나 1)입니다.

source: Statements
ast: 문장

source: An assignment. ``targets`` is a list of nodes, and ``value`` is a single node.
ast: 대입. ``targets``\는 노드의 리스트이고, ``value``\는 단일 노드입니다.

source: Multiple nodes in ``targets`` represents assigning the same value to each. Unpacking is represented by putting a :class:`Tuple` or :class:`List` within ``targets``.
ast: ``targets``\의 여러 노드는 각각 같은 값을 할당하는 것을 나타냅니다. 언 패킹은 ``targets`` 내에 :class:`Tuple`\이나 :class:`List`\를 넣어 표현됩니다.

source: ``type_comment`` is an optional string with the type annotation as a comment.
ast: ``type_comment``\는 형 어노테이션이 주석으로 포함된 선택적 문자열입니다.

source: An assignment with a type annotation. ``target`` is a single node and can be a :class:`Name`, a :class:`Attribute` or a :class:`Subscript`. ``annotation`` is the annotation, such as a :class:`Constant` or :class:`Name` node. ``value`` is a single optional node. ``simple`` is a boolean integer set to True for a :class:`Name` node in ``target`` that do not appear in between parenthesis and are hence pure names and not expressions.
ast: 형 주석이 있는 대입. ``target``\은 단일 노드이며 :class:`Name`, :class:`Attribute` 또는 :class:`Subscript`\일 수 있습니다. ``annotation``\은 :class:`Constant`\나 :class:`Name` 노드와 같은 어노테이션입니다. ``value``\는 단일 선택적 노드입니다. ``simple``\은 괄호 사이에 나타나지 않은 순수한 이름이며 표현식이 아닌 ``target``\의 :class:`Name` 노드에 대해 True로 설정된 불리언 정수입니다.

source: Augmented assignment, such as ``a += 1``. In the following example, ``target`` is a :class:`Name` node for ``x`` (with the :class:`Store` context), ``op`` is :class:`Add`, and ``value`` is a :class:`Constant` with value for 1.
ast: 증분 대입, 가령 ``a += 1``. 다음 예에서, ``target``\은 ``x``\(:class:`Store` 컨텍스트로)를 위한 :class:`Name` 노드이고, ``op``\는 :class:`Add`\이며, ``value``\는 값이 1인 :class:`Constant`\입니다.

source: The ``target`` attribute connot be of class :class:`Tuple` or :class:`List`, unlike the targets of :class:`Assign`.
ast: ``target`` 어트리뷰트는 :class:`Assign`\의 대상과 달리 :class:`Tuple`\이나 :class:`List` 클래스일 수 없습니다.

source: A ``raise`` statement. ``exc`` is the exception object to be raised, normally a :class:`Call` or :class:`Name`, or ``None`` for a standalone ``raise``. ``cause`` is the optional part for ``y`` in ``raise x from y``.
ast: ``raise`` 문. ``exc``\는 발생시킬 예외 객체로 일반적으로 :class:`Call`\이나 :class:`Name`\이거나, 독립 ``raise``\의 경우 ``None``\입니다. ``cause``\는 ``raise x from y``\에서 ``y``\에 해당하는 선택적 부분입니다.

source: An assertion. ``test`` holds the condition, such as a :class:`Compare` node. ``msg`` holds the failure message.
ast: 어서션. ``test``\는 (:class:`Compare` 노드와 같은) 조건을 보유합니다. ``msg``\는 실패 메시지를 보유합니다.

source: Represents a ``del`` statement. ``targets`` is a list of nodes, such as :class:`Name`, :class:`Attribute` or :class:`Subscript` nodes.
ast: ``del`` 문을 나타냅니다. ``targets``\는 :class:`Name`, :class:`Attribute` 또는 :class:`Subscript` 같은 노드들의 리스트입니다.

source: A ``pass`` statement.
ast: ``pass`` 문.

source: Other statements which are only applicable inside functions or loops are described in other sections.
ast: 함수나 루프 내부에만 적용할 수 있는 다른 문장들은 다른 섹션에 설명되어 있습니다.

source: Imports
ast: 임포트

source: An import statement. ``names`` is a list of :class:`alias` nodes.
ast: import 문. ``names``\는 :class:`alias` 노드의 리스트입니다.

source: Represents ``from x import y``. ``module`` is a raw string of the 'from' name, without any leading dots, or ``None`` for statements such as ``from . import foo``. ``level`` is an integer holding the level of the relative import (0 means absolute import).
ast: ``from x import y``\를 나타냅니다. ``module``\은 선행 점이 없는 'from' 이름의 원시 문자열이며, ``from . import foo``\와 같은 문장의 경우 ``None``\입니다. ``level``\은 상대 임포트 수준을 보유하는 정수입니다 (0은 절대 임포트를 의미합니다).

source: Both parameters are raw strings of the names. ``asname`` can be ``None`` if the regular name is to be used.
ast: 두 매개 변수 모두 이름의 원시 문자열입니다. 정규 이름을 사용하면 ``asname``\은 ``None``\이 될 수 있습니다.

source: Control flow
ast: 제어 흐름

source: Optional clauses such as ``else`` are stored as an empty list if they're not present.
ast: ``else``\와 같은 선택적 절은 존재하지 않으면 빈 목록으로 저장됩니다.

source: An ``if`` statement. ``test`` holds a single node, such as a :class:`Compare` node. ``body`` and ``orelse`` each hold a list of nodes.
ast: ``if`` 문. ``test``\는 (:class:`Compare` 노드와 같은) 단일 노드를 보유합니다. ``body``\와 ``orelse``\는 각각 노드 리스트를 보유합니다.

source: ``elif`` clauses don't have a special representation in the AST, but rather appear as extra :class:`If` nodes within the ``orelse`` section of the previous one.
ast: ``elif`` 절은 AST에서 특별한 표현이 없지만, 앞의 ``orelse`` 섹션 안에서 추가 :class:`If` 노드로 나타납니다.

source: A ``for`` loop. ``target`` holds the variable(s) the loop assigns to, as a single :class:`Name`, :class:`Tuple` or :class:`List` node. ``iter`` holds the item to be looped over, again as a single node. ``body`` and ``orelse`` contain lists of nodes to execute. Those in ``orelse`` are executed if the loop finishes normally, rather than via a ``break`` statement.
ast: ``for`` 루프 ``target``\은 루프가 대입하는 변수를 단일 :class:`Name`, :class:`Tuple` 또는 :class:`List` 노드로 보유합니다. ``iter``\는 루핑할 항목을 역시 단일 노드로 보유합니다. ``body``\와 ``orelse``\는 실행할 노드의 리스트를 포함합니다. 루프가 ``break`` 문을 통하지 않고 정상적으로 완료되면 ``orelse``\에 있는 노드가 실행됩니다.

source: A ``while`` loop. ``test`` holds the condition, such as a :class:`Compare` node.
ast: ``while`` 루프. ``test``\는 (:class:`Compare` 노드와 같은) 조건을 보유합니다.

source: The ``break`` and ``continue`` statements.
ast: ``break``\와 ``continue`` 문.

source: ``try`` blocks. All attributes are list of nodes to execute, except for ``handlers``, which is a list of :class:`ExceptHandler` nodes.
ast: ``try`` 블록. :class:`ExceptHandler` 노드의 리스트인 ``handlers``\를 제외한, 모든 어트리뷰트는 실행할 노드의 리스트입니다.

source: A single ``except`` clause. ``type`` is the exception type it will match, typically a :class:`Name` node (or ``None`` for a catch-all ``except:`` clause). ``name`` is a raw string for the name to hold the exception, or ``None`` if the clause doesn't have ``as foo``. ``body`` is a list of nodes.
ast: 단일 ``except`` 절. ``type``\은 일치할 예외 형이며, 일반적으로 :class:`Name` 노드(또는 모두 잡는 ``except:`` 절의 경우는 ``None``)입니다. ``name``\은 예외를 담을 이름을 위한 원시 문자열이거나, 절에 ``as foo``\가 없으면 ``None``\입니다. ``body``\는 노드의 리스트입니다.

source: A ``with`` block. ``items`` is a list of :class:`withitem` nodes representing the context managers, and ``body`` is the indented block inside the context.
ast: ``with`` 블록. ``items``\는 컨텍스트 관리자를 나타내는 :class:`withitem` 노드의 리스트이며, ``body``\는 컨텍스트 내에서 들여쓰기 된 블록입니다.

source: A single context manager in a ``with`` block. ``context_expr`` is the context manager, often a :class:`Call` node. ``optional_vars`` is a :class:`Name`, :class:`Tuple` or :class:`List` for the ``as foo`` part, or ``None`` if that isn't used.
ast: ``with`` 블록의 단일 컨텍스트 관리자. ``context_expr``\은 컨텍스트 관리자이며, 종종 :class:`Call` 노드입니다. ``optional_vars``\는 ``as foo`` 부분의 경우 :class:`Name`, :class:`Tuple` 또는 :class:`List`\이거나, 사용하지 않으면 ``None``\입니다.

source: Function and class definitions
ast: 함수와 클래스 정의

source: A function definition.
ast: 함수 정의.

source: ``name`` is a raw string of the function name.
ast: ``name``\은 함수 이름의 원시 문자열입니다.

source: ``args`` is a :class:`arguments` node.
ast: ``args``\는 :class:`arguments` 노드입니다.
