Repository: Isaac-Lee/python-docs-ko
Catalog: library/*.po
Languages: ast

source: ``body`` is the list of nodes inside the function.
ast: ``body``\는 함수 내부의 노드 리스트입니다.

source: ``decorator_list`` is the list of decorators to be applied, stored outermost first (i.e. the first in the list will be applied last).
ast: ``decorator_list``\는 적용할 데코레이터 리스트이며, 가장 바깥쪽에 먼저 저장됩니다 (즉, 리스트의 첫 번째가 마지막에 적용됩니다).

source: ``returns`` is the return annotation.
ast: ``returns``\는 반환 어노테이션입니다.

source: ``lambda`` is a minimal function definition that can be used inside an expression. Unlike :class:`FunctionDef`, ``body`` holds a single node.
ast: ``lambda``\는 표현식 내에서 사용할 수 있는 최소 함수 정의입니다. :class:`FunctionDef`\와 달리, ``body``\는 단일 노드를 보유합니다.

source: The arguments for a function.
ast: 함수의 인자.

source: ``posonlyargs``, ``args`` and ``kwonlyargs`` are lists of :class:`arg` nodes.
ast: ``posonlyargs``, ``args`` 및 ``kwonlyargs``\는 :class:`arg` 노드의 리스트입니다.

source: ``vararg`` and ``kwarg`` are single :class:`arg` nodes, referring to the ``*args, **kwargs`` parameters.
ast: ``vararg``\와 ``kwarg``\는 ``*args, **kwargs`` 매개 변수를 참조하는 단일 :class:`arg` 노드입니다.

source: ``kw_defaults`` is a list of default values for keyword-only arguments. If one is ``None``, the corresponding argument is required.
ast: ``kw_defaults``\는 키워드 전용 인자의 기본값 리스트입니다. 어떤 것이 ``None``\이면, 해당 인자는 필수입니다.

source: ``defaults`` is a list of default values for arguments that can be passed positionally. If there are fewer defaults, they correspond to the last n arguments.
ast: ``defaults``\는 위치적으로 전달될 수 있는 인자의 기본값 리스트입니다. 기본값 수가 더 적으면, 마지막 n개의 인자에 해당합니다.

source: A single argument in a list. ``arg`` is a raw string of the argument name, ``annotation`` is its annotation, such as a :class:`Str` or :class:`Name` node.
ast: 리스트의 단일 인자. ``arg``\는 인자 이름의 원시 문자열이고, ``annotation``\은 :class:`Str`\이나 :class:`Name` 노드와 같은 어노테이션입니다.

source: ``type_comment`` is an optional string with the type annotation as a comment
ast: ``type_comment``\는 주석으로 제공된 형 어노테이션이 있는 선택적 문자열입니다.

source: A ``return`` statement.
ast: ``return`` 문.

source: A ``yield`` or ``yield from`` expression. Because these are expressions, they must be wrapped in a :class:`Expr` node if the value sent back is not used.
ast: ``yield``\나 ``yield from`` 표현식. 이들은 표현식이라서, 반환된 값이 사용되지 않으면 :class:`Expr` 노드에 래핑 되어야 합니다.

source: ``global`` and ``nonlocal`` statements. ``names`` is a list of raw strings.
ast: ``global``\과 ``nonlocal`` 문. ``names``\는 원시 문자열 리스트입니다.

source: A class definition.
ast: 클래스 정의.

source: ``name`` is a raw string for the class name
ast: ``name``\은 클래스 이름의 원시 문자열입니다.

source: ``bases`` is a list of nodes for explicitly specified base classes.
ast: ``bases``\는 명시적으로 지정된 베이스 클래스의 노드 리스트입니다.

source: ``keywords`` is a list of :class:`keyword` nodes, principally for 'metaclass'. Other keywords will be passed to the metaclass, as per `PEP-3115 <http://www.python.org/dev/peps/pep-3115/>`_.
ast: ``keywords``\는 :class:`keyword` 노드 리스트입니다, 주로 'metaclass'를 위한 것입니다. 다른 키워드는 `PEP-3115 <http://www.python.org/dev/peps/pep-3115/>`_\에 따라 메타 클래스로 전달됩니다.

source: ``starargs`` and ``kwargs`` are each a single node, as in a function call. starargs will be expanded to join the list of base classes, and kwargs will be passed to the metaclass.
ast: ``starargs``\와 ``kwargs``\는 함수 호출에서와같이 각각 단일 노드입니다. starargs는 베이스 클래스 리스트에 연결하도록 확장되고, kwargs는 메타 클래스로 전달됩니다.

source: ``body`` is a list of nodes representing the code within the class definition.
ast: ``body``\는 클래스 정의 내에서 코드를 나타내는 노드 리스트입니다.

source: ``decorator_list`` is a list of nodes, as in :class:`FunctionDef`.
ast: ``decorator_list``\는 :class:`FunctionDef`\에서와 같이 노드 리스트입니다.

source: Async and await
ast: Async와 await

source: An ``async def`` function definition. Has the same fields as :class:`FunctionDef`.
ast: ``async def`` 함수 정의. :class:`FunctionDef`\와 같은 필드를 갖습니다.

source: An ``await`` expression. ``value`` is what it waits for. Only valid in the body of an :class:`AsyncFunctionDef`.
ast: ``await`` 표현식. ``value``\는 기다릴 대상입니다. :class:`AsyncFunctionDef`\의 본문에서만 유효합니다.

source: ``async for`` loops and ``async with`` context managers. They have the same fields as :class:`For` and :class:`With`, respectively. Only valid in the body of an :class:`AsyncFunctionDef`.
ast: ``async for`` 루프와 ``async with`` 컨텍스트 관리자. 이들은 각각 :class:`For`\와 :class:`With`\와 같은 필드를 갖습니다. :class:`AsyncFunctionDef`\의 본문에서만 유효합니다.

source: When a string is parsed by :func:`ast.parse`, operator nodes (subclasses of :class:`ast.operator`, :class:`ast.unaryop`, :class:`ast.cmpop`, :class:`ast.boolop` and :class:`ast.expr_context`) on the returned tree will be singletons. Changes to one will be reflected in all other occurrences of the same value (e.g. :class:`ast.Add`).
ast: 문자열이 :func:`ast.parse`\로 구문 분석될 때, 반환된 트리의 연산자 노드(:class:`ast.operator`, :class:`ast.unaryop`, :class:`ast.cmpop`, :class:`ast.boolop` 및 :class:`ast.expr_context`\의 서브 클래스)는 싱글톤이 됩니다. 어느 하나의 변경 사항은 같은 값으로 등장하는 다른 모든 곳에 반영됩니다 (예를 들어 :class:`ast.Add`).

source: :mod:`ast` Helpers
ast: :mod:`ast` 도우미

source: Apart from the node classes, the :mod:`ast` module defines these utility functions and classes for traversing abstract syntax trees:
ast: 노드 클래스 외에도, :mod:`ast` 모듈은 추상 구문 트리를 탐색하기 위해 다음 유틸리티 함수와 클래스를 정의합니다:

source: Parse the source into an AST node. Equivalent to ``compile(source, filename, mode, ast.PyCF_ONLY_AST)``.
ast: 소스를 AST 노드로 구문 분석합니다. ``compile(source, filename, mode, ast.PyCF_ONLY_AST)``\와 동등합니다.

source: If ``type_comments=True`` is given, the parser is modified to check and return type comments as specified by :pep:`484` and :pep:`526`. This is equivalent to adding :data:`ast.PyCF_TYPE_COMMENTS` to the flags passed to :func:`compile()`. This will report syntax errors for misplaced type comments. Without this flag, type comments will be ignored, and the ``type_comment`` field on selected AST nodes will always be ``None``. In addition, the locations of ``# type: ignore`` comments will be returned as the ``type_ignores`` attribute of :class:`Module` (otherwise it is always an empty list).
ast: ``type_comments=True``\가 제공되면, 구문 분석기는 :pep:`484`\와 :pep:`526`\에 지정된 형 주석을 확인하고 반환하도록 수정됩니다. 이는 :func:`compile()`\에 전달된 플래그에 :data:`ast.PyCF_TYPE_COMMENTS`\를 추가하는 것과 같습니다. 이것은 잘못 배치된 형 주석에 대한 문법 에러를 보고합니다. 이 플래그가 없으면, 형 주석은 무시되고, 선택한 AST 노드의 ``type_comment`` 필드는 항상 ``None``\입니다. 또한, ``# type: ignore`` 주석의 위치는 :class:`Module`\의 ``type_ignores`` 어트리뷰트로 반환됩니다 (그렇지 않으면 항상 빈 리스트입니다).

source: In addition, if ``mode`` is ``'func_type'``, the input syntax is modified to correspond to :pep:`484` "signature type comments", e.g. ``(str, int) -> List[str]``.
ast: 또한, ``mode``\가 ``'func_type'``\이면, 입력 문법은 :pep:`484` "서명 형 주석"에 따라 수정됩니다, 예를 들어 ``(str, int) -> List[str]``.

source: Also, setting ``feature_version`` to a tuple ``(major, minor)`` will attempt to parse using that Python version's grammar. Currently ``major`` must equal to ``3``. For example, setting ``feature_version=(3, 4)`` will allow the use of ``async`` and ``await`` as variable names. The lowest supported version is ``(3, 4)``; the highest is ``sys.version_info[0:2]``.
ast: 또한, ``feature_version``\을 튜플 ``(major, minor)``\로 설정하면 해당 파이썬 버전의 문법을 사용하여 구문 분석을 시도합니다. 현재 ``major``\는 ``3``\과 같아야 합니다. 예를 들어, ``feature_version=(3, 4)``\를 설정하면 변수 이름으로 ``async``\와 ``await``\를 사용할 수 있습니다. 가장 낮은 지원 버전은 ``(3, 4)``\입니다; 가장 높은 것은 ``sys.version_info[0:2]``\입니다.

source: It is possible to crash the Python interpreter with a sufficiently large/complex string due to stack depth limitations in Python's AST compiler.
ast: 파이썬 AST 컴파일러의 스택 깊이 제한으로 인해 충분히 크고/복잡한 문자열로 파이썬 인터프리터가 충돌하도록 만들 수 있습니다.

source: Added ``type_comments``, ``mode='func_type'`` and ``feature_version``.
ast: ``type_comments``, ``mode='func_type'`` 및 ``feature_version``\ 추가했습니다.

source: Unparse an :class:`ast.AST` object and generate a string with code that would produce an equivalent :class:`ast.AST` object if parsed back with :func:`ast.parse`.
ast: :class:`ast.AST` 객체를 역 구문 분석하고 :func:`ast.parse`\로 다시 구문 분석할 경우 동등한 :class:`ast.AST` 객체를 생성하는 코드가 포함된 문자열을 생성합니다.

source: The produced code string will not necessarily be equal to the original code that generated the :class:`ast.AST` object (without any compiler optimizations, such as constant tuples/frozensets).
ast: 생성된 코드 문자열은 :class:`ast.AST` 객체를 생성한 원래 코드와 반드시 같을 필요는 없습니다 (상수 튜플/frozenset과 같은 컴파일러 최적화 없이).

source: Trying to unparse a highly complex expression would result with :exc:`RecursionError`.
ast: 매우 복잡한 표현식을 역 구분 분석하려고 하면 :exc:`RecursionError`\가 발생할 수 있습니다.

source: Safely evaluate an expression node or a string containing a Python literal or container display. The string or node provided may only consist of the following Python literal structures: strings, bytes, numbers, tuples, lists, dicts, sets, booleans, and ``None``.
ast: 파이썬 리터럴 이나 컨테이너 디스플레이를 포함하는 표현식 노드나 문자열을 안전하게 평가합니다. 제공된 문자열이나 노드는 다음과 같은 파이썬 리터럴 구조로만 구성될 수 있습니다: 문자열, 바이트열, 숫자, 튜플, 리스트, 딕셔너리, 집합, 불리언 및 ``None``.

source: This can be used for safely evaluating strings containing Python values from untrusted sources without the need to parse the values oneself. It is not capable of evaluating arbitrarily complex expressions, for example involving operators or indexing.
ast: 값을 직접 구문 분석할 필요 없이 신뢰할 수 없는 소스의 파이썬 값을 포함하는 문자열을 안전하게 평가하는 데 사용할 수 있습니다. 예를 들어 연산자나 인덱싱이 개입한, 임의의 복잡한 표현식을 평가할 수 없습니다.

source: Now allows bytes and set literals.
ast: 이제 바이트열과 집합 리터럴을 허용합니다.

source: Now supports creating empty sets with ``'set()'``.
ast: 이제 ``'set()'``\으로 빈 집합을 만드는 것을 지원합니다.

source: Return the docstring of the given *node* (which must be a :class:`FunctionDef`, :class:`AsyncFunctionDef`, :class:`ClassDef`, or :class:`Module` node), or ``None`` if it has no docstring. If *clean* is true, clean up the docstring's indentation with :func:`inspect.cleandoc`.
ast: 주어진 *node*\(:class:`FunctionDef`, :class:`AsyncFunctionDef`, :class:`ClassDef` 또는 :class:`Module` 노드이어야 합니다)의 독스트링이나, 독스트링이 없으면 ``None``\을 반환합니다. *clean*\이 참이면, :func:`inspect.cleandoc`\으로 독스트링의 들여쓰기를 정리합니다.

source: :class:`AsyncFunctionDef` is now supported.
ast: :class:`AsyncFunctionDef` 가 이제 지원됩니다.

source: Get source code segment of the *source* that generated *node*. If some location information (:attr:`lineno`, :attr:`end_lineno`, :attr:`col_offset`, or :attr:`end_col_offset`) is missing, return ``None``.
ast: *node*\를 생성한 *source*\의 소스 코드 세그먼트를 가져옵니다. 일부 위치 정보(:attr:`lineno`, :attr:`end_lineno`, :attr:`col_offset` 또는 :attr:`end_col_offset`)가 없으면, ``None``\을 반환합니다.

source: If *padded* is ``True``, the first line of a multi-line statement will be padded with spaces to match its original position.
ast: *padded*\가 ``True``\이면, 여러 줄 문장의 첫 번째 줄은 원래 위치와 일치하도록 스페이스로 채워집니다.

source: When you compile a node tree with :func:`compile`, the compiler expects :attr:`lineno` and :attr:`col_offset` attributes for every node that supports them. This is rather tedious to fill in for generated nodes, so this helper adds these attributes recursively where not already set, by setting them to the values of the parent node. It works recursively starting at *node*.
ast: :func:`compile`\로 노드 트리를 컴파일할 때, 컴파일러는 지원하는 모든 노드에 대해 :attr:`lineno`\와 :attr:`col_offset` 어트리뷰트를 기대합니다. 생성된 노드를 채울 때는 이것이 다소 지루하므로, 이 도우미는 이러한 어트리뷰트를 재귀적으로 아직 설정되지 않은 위치에 부모 노드의 값으로 설정하여 추가합니다. *node*\부터 재귀적으로 작동합니다.

source: Increment the line number and end line number of each node in the tree starting at *node* by *n*. This is useful to "move code" to a different location in a file.
ast: *node*\에서 시작하는 트리에서 각 노드의 줄 번호와 끝 줄 번호를 *n*\만큼 증가시킵니다. 파일의 다른 위치로 "코드를 이동"하는 데 유용합니다.

source: Copy source location (:attr:`lineno`, :attr:`col_offset`, :attr:`end_lineno`, and :attr:`end_col_offset`) from *old_node* to *new_node* if possible, and return *new_node*.
ast: 가능하면 소스 위치(:attr:`lineno`, :attr:`col_offset`, :attr:`end_lineno` 및 :attr:`end_col_offset`)를 *old_node*\에서 *new_node*\로 복사하고, *new_node*\를 반환합니다.

source: Yield a tuple of ``(fieldname, value)`` for each field in ``node._fields`` that is present on *node*.
ast: *node*\에 존재하는 ``node._fields``\의 각 필드에 대해 ``(fieldname, value)`` 튜플을 산출합니다.

source: Yield all direct child nodes of *node*, that is, all fields that are nodes and all items of fields that are lists of nodes.
ast: *node*\의 모든 직접 자식 노드, 즉 노드인 모든 필드와 노드 리스트인 필드의 모든 항목을 산출합니다.

source: Recursively yield all descendant nodes in the tree starting at *node* (including *node* itself), in no specified order. This is useful if you only want to modify nodes in place and don't care about the context.
ast: *node*\로 시작하는 트리(*node* 자체를 포함합니다)의 모든 자손 노드를 지정된 순서 없이 재귀적으로 산출합니다. 이는 노드를 제자리에서 수정하고 문맥을 신경 쓰지 않을 때 유용합니다.

source: A node visitor base class that walks the abstract syntax tree and calls a visitor function for every node found. This function may return a value which is forwarded by the :meth:`visit` method.
ast: 추상 구문 트리를 걷고 발견된 모든 노드에 대해 방문자 함수를 호출하는 노드 방문자 베이스 클래스. 이 함수는 :meth:`visit` 메서드에 의해 전달되는 값을 반환할 수 있습니다.

source: This class is meant to be subclassed, with the subclass adding visitor methods.
ast: 이 클래스는 서브 클래싱하고자 하는 것이며, 서브 클래스는 방문자 메서드를 추가합니다.

source: Visit a node. The default implementation calls the method called :samp:`self.visit_{classname}` where *classname* is the name of the node class, or :meth:`generic_visit` if that method doesn't exist.
ast: 노드를 방문합니다. 기본 구현은 :samp:`self.visit_{classname}`\이라는 메서드를 호출하는데, 여기서 *classname* 은 노드 클래스의 이름입니다. 또는 이 메서드가 없으면 :meth:`generic_visit`\를 호출합니다.

source: This visitor calls :meth:`visit` on all children of the node.
ast: 이 방문자는 노드의 자식에 대해 :meth:`visit`\를 호출합니다.

source: Note that child nodes of nodes that have a custom visitor method won't be visited unless the visitor calls :meth:`generic_visit` or visits them itself.
ast: 방문자가 :meth:`generic_visit`\를 호출하거나 직접 방문하지 않는 한, 사용자 정의 방문자 메서드가 있는 노드의 자식 노드는 방문 되지 않음에 유의하십시오.

source: Don't use the :class:`NodeVisitor` if you want to apply changes to nodes during traversal. For this a special visitor exists (:class:`NodeTransformer`) that allows modifications.
ast: 탐색 중에 노드에 변경 사항을 적용하려면 :class:`NodeVisitor`\를 사용하지 마십시오. 이를 위해 수정을 허락하는 특수한 방문자(:class:`NodeTransformer`)가 있습니다.

source: Methods :meth:`visit_Num`, :meth:`visit_Str`, :meth:`visit_Bytes`, :meth:`visit_NameConstant` and :meth:`visit_Ellipsis` are deprecated now and will not be called in future Python versions. Add the :meth:`visit_Constant` method to handle all constant nodes.
ast: 메서드 :meth:`visit_Num`, :meth:`visit_Str`, :meth:`visit_Bytes`, :meth:`visit_NameConstant` 및 :meth:`visit_Ellipsis`\는 이제 폐지되었고 향후 파이썬 버전에서는 호출되지 않을 것입니다. 모든 상수 노드를 처리하려면 :meth:`visit_Constant` 메서드를 추가하십시오.

source: A :class:`NodeVisitor` subclass that walks the abstract syntax tree and allows modification of nodes.
ast: 추상 구문 트리를 걷고 노드 수정을 허락하는 :class:`NodeVisitor` 서브 클래스.

source: The :class:`NodeTransformer` will walk the AST and use the return value of the visitor methods to replace or remove the old node. If the return value of the visitor method is ``None``, the node will be removed from its location, otherwise it is replaced with the return value. The return value may be the original node in which case no replacement takes place.
ast: :class:`NodeTransformer`\는 AST를 걷고 방문자 메서드의 반환 값을 사용하여 이전 노드를 바꾸거나 제거합니다. 방문자 메서드의 반환 값이 ``None``\이면, 노드가 그 위치에서 제거되고, 그렇지 않으면 반환 값으로 치환됩니다. 반환 값은 원래 노드일 수 있으며, 이때는 치환이 일어나지 않습니다.

source: Here is an example transformer that rewrites all occurrences of name lookups (``foo``) to ``data['foo']``::
ast: 다음은 모든 이름 조회(``foo``)를 ``data['foo']``\로 다시 쓰는 변환기 예제입니다::

source: Keep in mind that if the node you're operating on has child nodes you must either transform the child nodes yourself or call the :meth:`generic_visit` method for the node first.
ast: 작업 중인 노드에 자식 노드가 있으면 자식 노드를 직접 변환하거나 노드에 대한 :meth:`generic_visit` 메서드를 먼저 호출해야 함을 염두에 두십시오.

source: For nodes that were part of a collection of statements (that applies to all statement nodes), the visitor may also return a list of nodes rather than just a single node.
ast: 문장의 컬렉션의 일부인 노드의 경우 (모든 문장 노드에 적용됩니다), 방문자는 단일 노드가 아닌 노드 리스트를 반환 할 수도 있습니다.

source: If :class:`NodeTransformer` introduces new nodes (that weren't part of original tree) without giving them location information (such as :attr:`lineno`), :func:`fix_missing_locations` should be called with the new sub-tree to recalculate the location information::
ast: :class:`NodeTransformer`\가 위치 정보(가령 :attr:`lineno`)를 제공하지 않고 (원래 트리의 일부가 아닌) 새 노드를 도입하면, 위치 정보를 다시 계산하려면 :func:`fix_missing_locations`\를 새 서브 트리로 호출해야 합니다::

source: Usually you use the transformer like this::
ast: 일반적으로 다음과 같이 변환기를 사용합니다::

source: Return a formatted dump of the tree in *node*. This is mainly useful for debugging purposes. If *annotate_fields* is true (by default), the returned string will show the names and the values for fields. If *annotate_fields* is false, the result string will be more compact by omitting unambiguous field names. Attributes such as line numbers and column offsets are not dumped by default. If this is wanted, *include_attributes* can be set to true.
ast: *node*\에서 포맷된 트리 덤프를 반환합니다. 이것은 주로 디버깅 목적으로 유용합니다. *annotate_fields*\가 참이면 (기본값), 반환된 문자열에 필드의 이름과 값이 표시됩니다. *annotate_fields*\가 거짓이면, 모호하지 않은 필드 이름을 생략하여 결과 문자열이 더 간결해집니다. 줄 번호와 열 오프셋과 같은 어트리뷰트는 기본적으로 덤프 되지 않습니다. 원한다면, *include_attributes*\를 참으로 설정할 수 있습니다.

source: If *indent* is a non-negative integer or string, then the tree will be pretty-printed with that indent level. An indent level of 0, negative, or ``""`` will only insert newlines. ``None`` (the default) selects the single line representation. Using a positive integer indent indents that many spaces per level. If *indent* is a string (such as ``"\t"``), that string is used to indent each level.
ast: *indent*\가 음이 아닌 정수나 문자열이면, 트리는 그 들여쓰기 수준으로 예쁘게 인쇄됩니다. 들여쓰기 수준 0, 음수 또는 ``""``\는 줄 넘김 만 삽입합니다. ``None``\(기본값)은 단일 줄 표현을 선택합니다. 양의 정수 indent를 사용하면 수준마다 그만큼 들여쓰기 됩니다. *indent*\가 문자열(가령 ``"\t"``)이면, 해당 문자열은 각 수준을 들여 쓰는 데 사용됩니다.

source: Added the *indent* option.
ast: *indent* 옵션을 추가했습니다.

source: Compiler Flags
ast: 컴파일러 플래그

source: The following flags may be passed to :func:`compile` in order to change effects on the compilation of a program:
ast: 프로그램 컴파일에 대한 효과를 변경하기 위해 다음 플래그를 :func:`compile`\에 전달할 수 있습니다:

source: Enables support for top-level ``await``, ``async for``, ``async with`` and async comprehensions.
ast: 최상위 수준 ``await``, ``async for``, ``async with`` 및 비동기 컴프리헨션에 대한 지원을 활성화합니다.

source: Generates and returns an abstract syntax tree instead of returning a compiled code object.
ast: 컴파일된 코드 객체를 반환하는 대신 추상 구문 트리를 생성하고 반환합니다.

source: Enables support for :pep:`484` and :pep:`526` style type comments (``# type: <type>``, ``# type: ignore <stuff>``).
ast: :pep:`484`\와 :pep:`526` 스타일 형 주석(``# type: <type>``, ``# type: ignore <stuff>``)에 대한 지원을 활성화합니다.

source: Command-Line Usage
ast: 명령 줄 사용법

source: The :mod:`ast` module can be executed as a script from the command line. It is as simple as:
ast: :mod:`ast` 모듈은 명령 줄에서 스크립트로 실행될 수 있습니다. 다음과 같이 간단합니다:

source: The following options are accepted:
ast: 다음과 같은 옵션이 허용됩니다:

source: Show the help message and exit.
ast: 도움말 메시지를 표시하고 종료합니다.

source: Specify what kind of code must be compiled, like the *mode* argument in :func:`parse`.
ast: :func:`parse`\의 *mode* 인자와 같이, 컴파일해야 하는 코드 종류를 지정합니다.

source: Don't parse type comments.
ast: 형 주석을 구문 분석하지 않습니다.

source: Include attributes such as line numbers and column offsets.
ast: 줄 번호와 열 오프셋과 같은 어트리뷰트를 포함합니다.

source: Indentation of nodes in AST (number of spaces).
ast: AST에서 노드 들여쓰기(스페이스 수).

source: If :file:`infile` is specified its contents are parsed to AST and dumped to stdout. Otherwise, the content is read from stdin.
ast: :file:`infile`\이 지정되면 그 내용이 AST로 구문 분석되고 stdout에 덤프 됩니다. 그렇지 않으면, stdin에서 내용을 읽습니다.

source: `Green Tree Snakes <https://greentreesnakes.readthedocs.io/>`_, an external documentation resource, has good details on working with Python ASTs.
ast: `Green Tree Snakes <https://greentreesnakes.readthedocs.io/>`_, 파이썬 AST로 작업하는 것에 대한 자세한 내용이 있는 외부 문서 자원.

source: `ASTTokens <https://asttokens.readthedocs.io/en/latest/user-guide.html>`_ annotates Python ASTs with the positions of tokens and text in the source code that generated them. This is helpful for tools that make source code transformations.
ast: `ASTTokens <https://asttokens.readthedocs.io/en/latest/user-guide.html>`_\는 토큰의 위치와 토큰을 생성한 소스 코드의 텍스트로 파이썬 AST에 주석을 추가합니다. 이는 소스 코드 변환을 수행하는 도구에 유용합니다.

source: `leoAst.py <http://leoeditor.com/appendices.html#leoast-py>`_ unifies the token-based and parse-tree-based views of python programs by inserting two-way links between tokens and ast nodes.
ast: `leoAst.py <http://leoeditor.com/appendices.html#leoast-py>`_\는 토큰과 ast 노드 사이에 양방향 링크를 삽입하여 파이썬 프로그램의 토큰 기반과 구문 분석 트리 기반 뷰를 통합합니다.

source: `LibCST <https://libcst.readthedocs.io/>`_ parses code as a Concrete Syntax Tree that looks like an ast tree and keeps all formatting details. It's useful for building automated refactoring (codemod) applications and linters.
ast: `LibCST <https://libcst.readthedocs.io/>`_\는 코드를 ast 트리처럼 보이고 모든 포매팅 세부 정보를 유지하는 구상 구문 트리(Concrete Syntax Tree)로 구문 분석합니다. 자동화된 리팩토링 (codemod) 응용 프로그램과 린터(linter)를 구축하는 데 유용합니다.

source: `Parso <https://parso.readthedocs.io>`_ is a Python parser that supports error recovery and round-trip parsing for different Python versions (in multiple Python versions). Parso is also able to list multiple syntax errors in your python file.
ast: `Parso <https://parso.readthedocs.io>`_\는 다른 파이썬 버전(여러 Python 버전에서)에 대한 에러 복구와 왕복 구문 분석(round-trip parsing)을 지원하는 파이썬 파서입니다. Parso는 여러분의 파이썬 파일에 있는 여러 구문 에러를 나열 할 수도 있습니다.
